; domain
(define (domain drone-dom)

    (:requirements
        :typing
    )

    (:types
        drone human box content location - object
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
    )

    (:action move
        :parameters (?d - drone ?from ?to - location)
        :precondition (and 
            (drone-at ?d ?from)
        )
        :effect (and
            (drone-at ?d ?to) 
            (not (drone-at ?d ?from))
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l20_p20_c20_g20_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	box11 - box
	box12 - box
	box13 - box
	box14 - box
	box15 - box
	box16 - box
	box17 - box
	box18 - box
	box19 - box
	box20 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
	human8 - human
	human9 - human
	human10 - human
	human11 - human
	human12 - human
	human13 - human
	human14 - human
	human15 - human
	human16 - human
	human17 - human
	human18 - human
	human19 - human
	human20 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-at box8 warehouse)
	(box-free box8)
	(box-at box9 warehouse)
	(box-free box9)
	(box-at box10 warehouse)
	(box-free box10)
	(box-at box11 warehouse)
	(box-free box11)
	(box-at box12 warehouse)
	(box-free box12)
	(box-at box13 warehouse)
	(box-free box13)
	(box-at box14 warehouse)
	(box-free box14)
	(box-at box15 warehouse)
	(box-free box15)
	(box-at box16 warehouse)
	(box-free box16)
	(box-at box17 warehouse)
	(box-free box17)
	(box-at box18 warehouse)
	(box-free box18)
	(box-at box19 warehouse)
	(box-free box19)
	(box-at box20 warehouse)
	(box-free box20)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 food)
	(box-has box6 food)
	(box-has box7 food)
	(box-has box8 meds)
	(box-has box9 meds)
	(box-has box10 meds)
	(box-has box11 meds)
	(box-has box12 meds)
	(box-has box13 meds)
	(box-has box14 meds)
	(box-has box15 meds)
	(box-has box16 meds)
	(box-has box17 meds)
	(box-has box18 meds)
	(box-has box19 meds)
	(box-has box20 meds)
	(human-at human1 loc2)
	(human-at human2 loc11)
	(human-at human3 loc12)
	(human-at human4 loc3)
	(human-at human5 loc2)
	(human-at human6 loc3)
	(human-at human7 loc10)
	(human-at human8 loc6)
	(human-at human9 loc15)
	(human-at human10 loc20)
	(human-at human11 loc15)
	(human-at human12 loc8)
	(human-at human13 loc8)
	(human-at human14 loc2)
	(human-at human15 loc11)
	(human-at human16 loc4)
	(human-at human17 loc8)
	(human-at human18 loc11)
	(human-at human19 loc7)
	(human-at human20 loc2)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human2 food)
	(human-has human2 meds)
	(human-has human3 food)
	(human-has human3 meds)
	(human-has human4 meds)
	(human-has human7 food)
	(human-has human10 food)
	(human-has human10 meds)
	(human-has human11 meds)
	(human-has human12 food)
	(human-has human12 meds)
	(human-has human13 meds)
	(human-has human14 meds)
	(human-has human15 food)
	(human-has human16 meds)
	(human-has human17 food)
	(human-has human17 meds)
	(human-has human18 meds)
	(human-has human19 meds)
	(human-has human20 meds)
	))
)

; plan
1. (pick-up drone1 box7 food warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry drone1 box7)
   goals met: 1 of 21
2. (move drone1 warehouse loc10)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc10)
   goals met: 0 of 21
3. (drop drone1 box7 food loc10 human7)
   deleted: (drone-carry drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc10) (human-has human7 food)
   goals met: 1 of 21
4. (move drone1 loc10 loc12)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 loc12)
   goals met: 1 of 21
5. (move drone1 loc12 warehouse)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 21
6. (pick-up drone1 box6 food warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry drone1 box6)
   goals met: 2 of 21
7. (move drone1 warehouse loc12)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 1 of 21
8. (drop drone1 box6 food loc12 human3)
   deleted: (drone-carry drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc12) (human-has human3 food)
   goals met: 2 of 21
9. (move drone1 loc12 warehouse)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 21
10. (pick-up drone1 box5 food warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry drone1 box5)
   goals met: 3 of 21
11. (move drone1 warehouse loc20)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc20)
   goals met: 2 of 21
12. (drop drone1 box5 food loc20 human10)
   deleted: (drone-carry drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc20) (human-has human10 food)
   goals met: 3 of 21
13. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 21
14. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry drone1 box4)
   goals met: 4 of 21
15. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 3 of 21
16. (drop drone1 box4 food loc8 human17)
   deleted: (drone-carry drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc8) (human-has human17 food)
   goals met: 4 of 21
17. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 21
18. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry drone1 box3)
   goals met: 5 of 21
19. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 4 of 21
20. (drop drone1 box3 food loc8 human12)
   deleted: (drone-carry drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc8) (human-has human12 food)
   goals met: 5 of 21
21. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 21
22. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry drone1 box2)
   goals met: 6 of 21
23. (move drone1 warehouse loc11)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 5 of 21
24. (drop drone1 box2 food loc11 human15)
   deleted: (drone-carry drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc11) (human-has human15 food)
   goals met: 6 of 21
25. (move drone1 loc11 warehouse)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 21
26. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry drone1 box1)
   goals met: 7 of 21
27. (move drone1 warehouse loc11)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 6 of 21
28. (drop drone1 box1 food loc11 human2)
   deleted: (drone-carry drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc11) (human-has human2 food)
   goals met: 7 of 21
29. (move drone1 loc11 warehouse)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 21
30. (pick-up drone1 box20 meds warehouse)
   deleted: (drone-free drone1) (box-at box20 warehouse)
   added: (drone-carry drone1 box20)
   goals met: 8 of 21
31. (move drone1 warehouse loc12)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 7 of 21
32. (drop drone1 box20 meds loc12 human3)
   deleted: (drone-carry drone1 box20) (box-free box20)
   added: (drone-free drone1) (box-at box20 loc12) (human-has human3 meds)
   goals met: 8 of 21
33. (move drone1 loc12 loc3)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 loc3)
   goals met: 8 of 21
34. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 21
35. (pick-up drone1 box19 meds warehouse)
   deleted: (drone-free drone1) (box-at box19 warehouse)
   added: (drone-carry drone1 box19)
   goals met: 9 of 21
36. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 8 of 21
37. (drop drone1 box19 meds loc3 human4)
   deleted: (drone-carry drone1 box19) (box-free box19)
   added: (drone-free drone1) (box-at box19 loc3) (human-has human4 meds)
   goals met: 9 of 21
38. (move drone1 loc3 loc20)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 loc20)
   goals met: 9 of 21
39. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 21
40. (pick-up drone1 box18 meds warehouse)
   deleted: (drone-free drone1) (box-at box18 warehouse)
   added: (drone-carry drone1 box18)
   goals met: 10 of 21
41. (move drone1 warehouse loc20)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc20)
   goals met: 9 of 21
42. (drop drone1 box18 meds loc20 human10)
   deleted: (drone-carry drone1 box18) (box-free box18)
   added: (drone-free drone1) (box-at box18 loc20) (human-has human10 meds)
   goals met: 10 of 21
43. (move drone1 loc20 loc15)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 loc15)
   goals met: 10 of 21
44. (move drone1 loc15 warehouse)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 21
45. (pick-up drone1 box17 meds warehouse)
   deleted: (drone-free drone1) (box-at box17 warehouse)
   added: (drone-carry drone1 box17)
   goals met: 11 of 21
46. (move drone1 warehouse loc15)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 10 of 21
47. (drop drone1 box17 meds loc15 human11)
   deleted: (drone-carry drone1 box17) (box-free box17)
   added: (drone-free drone1) (box-at box17 loc15) (human-has human11 meds)
   goals met: 11 of 21
48. (move drone1 loc15 loc4)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 loc4)
   goals met: 11 of 21
49. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 21
50. (pick-up drone1 box16 meds warehouse)
   deleted: (drone-free drone1) (box-at box16 warehouse)
   added: (drone-carry drone1 box16)
   goals met: 12 of 21
51. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 11 of 21
52. (drop drone1 box16 meds loc4 human16)
   deleted: (drone-carry drone1 box16) (box-free box16)
   added: (drone-free drone1) (box-at box16 loc4) (human-has human16 meds)
   goals met: 12 of 21
53. (move drone1 loc4 loc8)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 loc8)
   goals met: 12 of 21
54. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 21
55. (pick-up drone1 box15 meds warehouse)
   deleted: (drone-free drone1) (box-at box15 warehouse)
   added: (drone-carry drone1 box15)
   goals met: 13 of 21
56. (move drone1 warehouse loc7)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 12 of 21
57. (drop drone1 box15 meds loc7 human19)
   deleted: (drone-carry drone1 box15) (box-free box15)
   added: (drone-free drone1) (box-at box15 loc7) (human-has human19 meds)
   goals met: 13 of 21
58. (move drone1 loc7 loc8)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 loc8)
   goals met: 13 of 21
59. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 21
60. (pick-up drone1 box14 meds warehouse)
   deleted: (drone-free drone1) (box-at box14 warehouse)
   added: (drone-carry drone1 box14)
   goals met: 14 of 21
61. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 13 of 21
62. (drop drone1 box14 meds loc8 human12)
   deleted: (drone-carry drone1 box14) (box-free box14)
   added: (drone-free drone1) (box-at box14 loc8) (human-has human12 meds)
   goals met: 14 of 21
63. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 21
64. (pick-up drone1 box13 meds warehouse)
   deleted: (drone-free drone1) (box-at box13 warehouse)
   added: (drone-carry drone1 box13)
   goals met: 15 of 21
65. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 14 of 21
66. (drop drone1 box13 meds loc8 human13)
   deleted: (drone-carry drone1 box13) (box-free box13)
   added: (drone-free drone1) (box-at box13 loc8) (human-has human13 meds)
   goals met: 15 of 21
67. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 21
68. (pick-up drone1 box12 meds warehouse)
   deleted: (drone-free drone1) (box-at box12 warehouse)
   added: (drone-carry drone1 box12)
   goals met: 16 of 21
69. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 15 of 21
70. (drop drone1 box12 meds loc8 human17)
   deleted: (drone-carry drone1 box12) (box-free box12)
   added: (drone-free drone1) (box-at box12 loc8) (human-has human17 meds)
   goals met: 16 of 21
71. (move drone1 loc8 loc11)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 loc11)
   goals met: 16 of 21
72. (move drone1 loc11 warehouse)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 21
73. (pick-up drone1 box11 meds warehouse)
   deleted: (drone-free drone1) (box-at box11 warehouse)
   added: (drone-carry drone1 box11)
   goals met: 17 of 21
74. (move drone1 warehouse loc11)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 16 of 21
75. (drop drone1 box11 meds loc11 human2)
   deleted: (drone-carry drone1 box11) (box-free box11)
   added: (drone-free drone1) (box-at box11 loc11) (human-has human2 meds)
   goals met: 17 of 21
76. (move drone1 loc11 warehouse)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 21
77. (pick-up drone1 box10 meds warehouse)
   deleted: (drone-free drone1) (box-at box10 warehouse)
   added: (drone-carry drone1 box10)
   goals met: 18 of 21
78. (move drone1 warehouse loc11)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 17 of 21
79. (drop drone1 box10 meds loc11 human18)
   deleted: (drone-carry drone1 box10) (box-free box10)
   added: (drone-free drone1) (box-at box10 loc11) (human-has human18 meds)
   goals met: 18 of 21
80. (move drone1 loc11 loc2)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 loc2)
   goals met: 18 of 21
81. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 19 of 21
82. (pick-up drone1 box9 meds warehouse)
   deleted: (drone-free drone1) (box-at box9 warehouse)
   added: (drone-carry drone1 box9)
   goals met: 19 of 21
83. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 18 of 21
84. (drop drone1 box9 meds loc2 human14)
   deleted: (drone-carry drone1 box9) (box-free box9)
   added: (drone-free drone1) (box-at box9 loc2) (human-has human14 meds)
   goals met: 19 of 21
85. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 21
86. (pick-up drone1 box8 meds warehouse)
   deleted: (drone-free drone1) (box-at box8 warehouse)
   added: (drone-carry drone1 box8)
   goals met: 20 of 21
87. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 19 of 21
88. (drop drone1 box8 meds loc2 human20)
   deleted: (drone-carry drone1 box8) (box-free box8)
   added: (drone-free drone1) (box-at box8 loc2) (human-has human20 meds)
   goals met: 20 of 21
89. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 21 of 21
